---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetColumnWidthInPixels(System.Int32)
source: html/49b5461a-2957-98d0-993f-b3cbf00096a8.htm
---
# Autodesk.Revit.DB.TableSectionData.GetColumnWidthInPixels Method

This returns a column's width in logical pixels

## Syntax (C#)
```csharp
public int GetColumnWidthInPixels(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.